#ifndef __OLEDCHINESE_8X16_H
#define __OLEDCHINESE_8X16_H
#include "stm32f10x.h"

//结构体的第一个成员name[3]用来存放汉字的区码和位码以及一个字符串结束字符'\0'，这里的'\0'不是必要的
//结构体的第二个成员dat[32]用来存放汉字点阵数据，这里采用的16*16的汉字  ---> 16*16/8=32，故单个汉字的点阵数据为32字节
typedef struct {
    char name[3];
    char dat[32];
}Optimized_Chinese_8X16;


//-----------------------------------------------------------------------------------------
//适用于区位码的字库
//字体大小 8*16（16*16）
//字体：宋体
//取模走向：列行式 逆向  阴码
//取模软件：PCtoLCD2002
Optimized_Chinese_8X16 Hzk16[] = {

"智",
{0x10,0x94,0x53,0x32,0x1E,0x32,0x52,0x10,0x00,0x7E,0x42,0x42,0x42,0x7E,0x00,0x00,0x00,0x00,0x00,0xFF,0x49,0x49,0x49,0x49,0x49,0x49,0x49,0xFF,0x00,0x00,0x00,0x00},/*"智",4*/

};



















#endif /*__OLEDCHINESE_8X16_H*/
